export function addProductToCart(event: Event) {
  console.log('test!');
}
//   const buttonFromCatalog = document.querySelector('');
//   //если вызывается из каталога,
//   // проверяет нет ли такого в локал сторадж
//   // если есть, ничего не делает
//   // если нет, добавляет в локал сторадж, меняет надпись на кнопке (написать функцию, при открытии каталога обновлять данные в кнопке
//   //
//   // если вызывается из карточки товара,
//   // проверяет наличие на складе, если больше,
//   // то проверяет нет ли такого в локал сторадж
//   // если есть, прибавляет количество
//   // если такого нет то добавляет товар целый
//
//   if (event.target === )
// }
